package com.rapjoee.day20.demo01tcp;

/**
 * ClassName:Demo00TCP
 *
 * @Author:Mr.Zhan
 * @Date:2020/2/22 19:17
 * Description:
 *
 * TCP客户端与服务器端的交互
 *      TCP通信：面向连接的通信，客户端与服务器端必须经过三次握手才能建立连接才能进行通信【安全】
 *
 *    通信步骤：服务器端必须先开启，服务器端不会主动连接客户端，必须客户端主动连接服务器，客户端与服务器回建立一个连接
 *              连接中包含一个对象【io对象】，客户端与服务器之间就可以进行通信，通信的数据不只是字符，所以io对象是字节流对象
 *
 *    进行通信时，服务器必须明确两件事情：
 *          1、多个客户端与服务器通信时，服务器必须明确其与哪个客户端进行通信【服务器的accept方法，获取到客户端请求的对象】
 *          2、多个客户端与服务器通信时，服务器端需要使用多个io对象
 *                  而服务器端是不能产生io对象的，所以io对象来自于客户端，因此服务器是用每个客户端的io对象与客户端进行交互的
 *               服务器端使用客户端的字节输入流读取客户端发送的数据
 *               服务器端使用客户端的字节输出流与客户端回写
 *
 *
 *                  简单记：服务器端使用客户端的流与客户端进行通信
 *
 */
public class Demo00TCP {
}
